---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.ColumnsExceedSegment
source: html/68f3d01a-c7d8-9fa2-6b75-673061bfd09d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.ColumnsExceedSegment Property

Some columns in Graphical Column Schedule exceed the segment's upper/lower bounds. You can add levels or adjust the view parameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnsExceedSegment { get; }
```